In [1]:
import pandas as pd

In [2]:
s = pd.Series(['banana',42])
s

0    banana
1        42
dtype: object

In [3]:
s= pd.Series(data=['Wes Mckinney','Creat of Pandas'],index=['Person','Who'])
s

Person       Wes Mckinney
Who       Creat of Pandas
dtype: object

In [4]:
scientists=pd.DataFrame({'Name':['Rosalin Franklin','William Gosset'],
                         'Occupation':['Chemist','Statistician'],
                         'Born':['1920-07-25','1876-06-13'],
                         'Died':['1958-04-16','1937-10-16'],
                         'age':[37,61]})
scientists

               Name    Occupation        Born        Died  age
0  Rosalin Franklin       Chemist  1920-07-25  1958-04-16   37
1    William Gosset  Statistician  1876-06-13  1937-10-16   61

In [5]:
scientists=pd.DataFrame({'Name':['Rosalin Franklin','William Gosset'],
                         'Occupation':['Chemist','Statistician'],
                         'Born':['1920-07-25','1876-06-13'],
                         'Died':['1958-04-16','1937-10-16'],
                         'Age':[37,61]},index=['Rosalin Franklin','William Gosset'],
                         columns=['Occupation','Born','Died','Age'])
scientists

                    Occupation        Born        Died  Age
Rosalin Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset    Statistician  1876-06-13  1937-10-16   61

In [6]:
first_row = scientists.loc['William Gosset']
type(first_row)
first_row

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

In [7]:
first_row.index

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [8]:
first_row.values

array(['Statistician', '1876-06-13', '1937-10-16', 61], dtype=object)

In [9]:
scientists.shape

(2, 4)

In [10]:
scientists.size

8

In [11]:
print(first_row.keys())

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [12]:
print(first_row.index[0])

Occupation

In [13]:
print(first_row.keys()[0])

Occupation

In [14]:
ages=scientists['Age']
ages

Rosalin Franklin    37
William Gosset      61
Name: Age, dtype: int64

In [16]:
ages.mean()

49.0

In [17]:
ages.min()

37

In [18]:
ages.max()

61

In [19]:
ages.std()

16.97056274847714

In [24]:
s = pd.Series(['llama', 'cow', 'llama', 'beetle', 'llama',
                'hippo'], name='animal')
s
s.isin(['cow', 'llama'])

0     True
1     True
2     True
3    False
4     True
5    False
Name: animal, dtype: bool

In [23]:
~s.isin(['cow', 'llama'])

0    False
1    False
2    False
3     True
4    False
5     True
Name: animal, dtype: bool

In [25]:
s

0     llama
1       cow
2     llama
3    beetle
4     llama
5     hippo
Name: animal, dtype: object

In [28]:
scientists = pd.read_csv(r'C:\Users\KDP-14\Desktop\DATA-20240712T084827Z-001\DATA\scientists.csv')
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [29]:
ages=scientists['Age']
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [30]:
ages.describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [32]:
ages.mean()

59.125

In [33]:
ages[ages > ages.mean()]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [34]:
ages > ages.mean()

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [35]:
type(ages>ages.mean())

pandas.core.series.Series

In [36]:
manual_bool_values =[True,True,False,False,True,True,False,True]
ages[manual_bool_values]

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

In [37]:
ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [38]:
ages*ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [39]:
ages+100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [40]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [41]:
ages + pd.Series([1,100])

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [42]:
import numpy as np

In [44]:
# ages + np.array([1,100])

In [45]:
ages

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [49]:
rev_ages=ages.sort_index(ascending=False)
rev_ages

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [50]:
ages*2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [51]:
ages + rev_ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [52]:
scientists.index

RangeIndex(start=0, stop=8, step=1)

In [53]:
scientists.columns

Index(['Name', 'Born', 'Died', 'Age', 'Occupation'], dtype='object')

In [54]:
scientists.values

array([['Rosaline Franklin', '1920-07-25', '1958-04-16', 37, 'Chemist'],
       ['William Gosset', '1876-06-13', '1937-10-16', 61, 'Statistician'],
       ['Florence Nightingale', '1820-05-12', '1910-08-13', 90, 'Nurse'],
       ['Marie Curie', '1867-11-07', '1934-07-04', 66, 'Chemist'],
       ['Rachel Carson', '1907-05-27', '1964-04-14', 56, 'Biologist'],
       ['John Snow', '1813-03-15', '1858-06-16', 45, 'Physician'],
       ['Alan Turing', '1912-06-23', '1954-06-07', 41,
        'Computer Scientist'],
       ['Johann Gauss', '1777-04-30', '1855-02-23', 77, 'Mathematician']],
      dtype=object)